u-blox/ubxlib/port/platform/stm32cube/src/u_port_uart.c
// Table of functions LL_DMA_IsActiveFlag_TCx(DMA_TypeDef *DMAx) for each stream.
static const uint32_t (*gpLlDmaIsActiveFlagTc[]) (DMA_TypeDef *)  = {LL_DMA_IsActiveFlag_TC0,
                                                                     LL_DMA_IsActiveFlag_TC1,
                                                                     LL_DMA_IsActiveFlag_TC2,
                                                                     LL_DMA_IsActiveFlag_TC3,
                                                                     LL_DMA_IsActiveFlag_TC4,
                                                                     LL_DMA_IsActiveFlag_TC5,
                                                                     LL_DMA_IsActiveFlag_TC6,
                                                                     LL_DMA_IsActiveFlag_TC7
                                                                    };

// Table of the constant data per UART.
static const uPortUartConstData_t gUartCfg[] = {{}, // This to avoid having to -1 all the time
    {
        USART1,
        U_CFG_HW_UART1_DMA_ENGINE,
        U_CFG_HW_UART1_DMA_STREAM,
        U_CFG_HW_UART1_DMA_CHANNEL,
        USART1_IRQn
    },
    {
        USART2,
        U_CFG_HW_UART2_DMA_ENGINE,
        U_CFG_HW_UART2_DMA_STREAM,
        U_CFG_HW_UART2_DMA_CHANNEL,
        USART2_IRQn
    },
    {
        USART3,
        U_CFG_HW_UART3_DMA_ENGINE,
        U_CFG_HW_UART3_DMA_STREAM,
        U_CFG_HW_UART3_DMA_CHANNEL,
        USART3_IRQn
    },
    {
        UART4,
        U_CFG_HW_UART4_DMA_ENGINE,
        U_CFG_HW_UART4_DMA_STREAM,
        U_CFG_HW_UART4_DMA_CHANNEL,
        UART4_IRQn
    },
    {
        UART5,
        U_CFG_HW_UART5_DMA_ENGINE,
        U_CFG_HW_UART5_DMA_STREAM,
        U_CFG_HW_UART5_DMA_CHANNEL,
        UART5_IRQn
    },
    {
        USART6,
        U_CFG_HW_UART6_DMA_ENGINE,
        U_CFG_HW_UART6_DMA_STREAM,
        U_CFG_HW_UART6_DMA_CHANNEL,
        USART6_IRQn
    },
    {
        UART7,
        U_CFG_HW_UART7_DMA_ENGINE,
        U_CFG_HW_UART7_DMA_STREAM,
        U_CFG_HW_UART7_DMA_CHANNEL,
        UART7_IRQn
    },
    {
        UART8,
        U_CFG_HW_UART8_DMA_ENGINE,
        U_CFG_HW_UART8_DMA_STREAM,
        U_CFG_HW_UART8_DMA_CHANNEL,
        UART8_IRQn
    }
};

// Table to make it possible for UART interrupts to get to the UART data
// without having to trawl through a list.  +1 is for the usual reason.
static uPortUartData_t *gpUart[U_PORT_MAX_NUM_UARTS + 1] = {NULL};

// Table to make it possible for a DMA interrupt to
// get to the UART data.  +1 is for the usual reason.
static uPortUartData_t *gpDmaUart[U_PORT_MAX_NUM_DMA_ENGINES + 1][U_PORT_MAX_NUM_DMA_STREAMS] = {NULL};

/* ----------------------------------------------------------------
 * STATIC FUNCTIONS
 * -------------------------------------------------------------- */

// Get the next free handle.
static int32_t nextHandleGet()
{
    int32_t handle = gNextHandle;

    gNextHandle++;
    // Can't have a negative handle, that means fail
    if (gNextHandle < 0) {
        gNextHandle = 0;
    }

    return handle;
}

// Add a UART data structure to the list.
// The required memory is malloc()ed.
// Note: gMutex should be locked before this is called.
static uPortUartData_t *pAddUart(uPortUartData_t *pUartData)
{
    uPortUartData_t **ppUartData = &gpUartDataHead;

    // Go to the end of the list
    while (*ppUartData != NULL) {
        ppUartData = &((*ppUartData)->pNext);
    }

    // Malloc memory for the item
    *ppUartData = (uPortUartData_t *) malloc(sizeof(uPortUartData_t));
    if (*ppUartData != NULL) {
        // Copy the data in
        memcpy(*ppUartData, pUartData, sizeof(uPortUartData_t));
        (*ppUartData)->pNext = NULL;
        // Set the UART table up to point to it
        // so that the UART interrupt can find it
        gpUart[pUartData->uart] = *ppUartData;
        // And set the other table up so that the
        // DMA interrupt can find the UART data as well
        gpDmaUart[pUartData->pConstData->dmaEngine][pUartData->pConstData->dmaStream] = *ppUartData;
    }

    return *ppUartData;
}

// Find the UART data structure for a given handle.
// Note: gMutex should be locked before this is called.
static uPortUartData_t *pGetUartDataByHandle(int32_t handle)
{
    uPortUartData_t *pUartData = gpUartDataHead;
    bool found = false;

    while (!found && (pUartData != NULL)) {
        if (pUartData->uartHandle == handle) {
            found = true;
        } else {
            pUartData = pUartData->pNext;
        }
    }

    return pUartData;
}

// Find the UART data structure for a given UART.
// Note: gMutex should be locked before this is called.
static uPortUartData_t *pGetUartDataByUart(int32_t uart)
{
    uPortUartData_t *pUartData = gpUartDataHead;
    bool found = false;

    while (!found && (pUartData != NULL)) {
        if (pUartData->uart == uart) {
            found = true;
        } else {
            pUartData = pUartData->pNext;
        }
    }

    return pUartData;
}

// Remove a UART from the list.
// The memory occupied is free()ed.
// Note: gMutex should be locked before this is called.
static bool removeUart(uPortUartData_t *pUartData)
{
    uPortUartData_t *pList = gpUartDataHead;
    uPortUartData_t *pTmp = NULL;
    bool found = false;

    // Find it in the list
    while (!found && (pList != NULL)) {
        if (pList == pUartData) {
            found = true;
        } else {
            pTmp = pList;
            pList = pList->pNext;
        }
    }

    // Remove the item
    if (pList != NULL) {
        // Move the next pointer of the previous
        // entry on
        if (pTmp != NULL) {
            pTmp->pNext = pList->pNext;
        }
        // NULL the entries in the two tables
        gpUart[pList->uart] = NULL;
        gpDmaUart[pList->pConstData->dmaEngine][pList->pConstData->dmaStream] = NULL;
        // Free memory and set the new head pointer if it's the head
        free(pList);
        if (pList == gpUartDataHead) {
            gpUartDataHead = pList->pNext;
        }
    }

    return found;
}

