u-blox/ubxlib/port/platform/stm32cube/src/u_port_uart.c
// Event handler, calls the user's event callback.
static void eventHandler(void *pParam, size_t paramLength)
{
    uPortUartEvent_t *pEvent = (uPortUartEvent_t *) pParam;
    uPortUartData_t *pUartData;

    (void) paramLength;

    // Don't need to worry about locking the mutex,
    // the close() function makes sure this event handler
    // exits cleanly and, in any case, the user callback
    // will want to be able to access functions in this
    // API which will need to lock the mutex.

    pUartData = pGetUartDataByHandle(pEvent->uartHandle);
    if ((pUartData != NULL) && (pUartData->pEventCallback != NULL)) {
        pUartData->pEventCallback(pEvent->uartHandle,
                                  pEvent->eventBitMap,
                                  pUartData->pEventCallbackParam);
    }
}

// Close a UART instance
// Note: gMutex should be locked before this is called.
static void uartClose(int32_t handle)
{
    uPortUartData_t *pUartData;
    USART_TypeDef *pUartReg;
    uint32_t dmaEngine;
    uint32_t dmaStream;

    pUartData = pGetUartDataByHandle(handle);
    if (pUartData != NULL) {

        pUartReg = gUartCfg[pUartData->uart].pReg;
        dmaEngine = gUartCfg[pUartData->uart].dmaEngine;
        dmaStream = gUartCfg[pUartData->uart].dmaStream;

        // Disable DMA and UART/USART interrupts
        NVIC_DisableIRQ(gpDmaStreamIrq[dmaEngine][dmaStream]);
        NVIC_DisableIRQ(gUartCfg[pUartData->uart].irq);

        // Disable DMA and USART, waiting for DMA to be
        // disabled first according to the note in
        // section 10.3.17 of ST's RM0090.
        LL_DMA_DisableStream(gpDmaReg[dmaEngine], dmaStream);
        while (LL_DMA_IsEnabledStream(gpDmaReg[dmaEngine], dmaStream)) {}
        LL_USART_Disable(pUartReg);
        LL_USART_DeInit(pUartReg);

        // Remove the callback if there is one
        if (pUartData->eventQueueHandle >= 0) {
            uPortEventQueueClose(pUartData->eventQueueHandle);
        }
        if (pUartData->rxBufferIsMalloced) {
            // Free the buffer
            free(pUartData->pRxBufferStart);
        }
        // And finally remove the UART from the list
        removeUart(pUartData);
    }
}

// Deal with data already received by the DMA; this
// code is run in INTERRUPT CONTEXT.
static inline void dataIrqHandler(uPortUartData_t *pUartData,
                                  char *pRxBufferWriteDma)
{
    uPortUartEventData_t uartSizeOrError = 0;

    // Work out how much new data there is
    if (pUartData->pRxBufferWrite < pRxBufferWriteDma) {
        // The current write pointer is behind the DMA write pointer,
        // the number of bytes received is simply the difference
        uartSizeOrError = pRxBufferWriteDma - pUartData->pRxBufferWrite;
    } else if (pUartData->pRxBufferWrite > pRxBufferWriteDma) {
        // The current write pointer is ahead of the DMA
        // write pointer, the number of bytes received
        // is up to the end of the buffer then wrap
        // around to the DMA write pointer pointer
        uartSizeOrError = (pUartData->pRxBufferStart +
                           pUartData->rxBufferSizeBytes -
                           pUartData->pRxBufferWrite) +
                          (pRxBufferWriteDma - pUartData->pRxBufferStart);
    }

    // Move the write pointer on
    pUartData->pRxBufferWrite += uartSizeOrError;
    if (pUartData->pRxBufferWrite >= pUartData->pRxBufferStart +
        pUartData->rxBufferSizeBytes) {
        pUartData->pRxBufferWrite = pUartData->pRxBufferWrite -
                                    pUartData->rxBufferSizeBytes;
    }

    // If there is new data and the user wanted to know
    // then send a message to let them know.
    if ((uartSizeOrError > 0) && pUartData->userNeedsNotify) {
        if ((pUartData->eventQueueHandle >= 0) &&
            (pUartData->eventFilter & U_PORT_UART_EVENT_BITMASK_DATA_RECEIVED)) {
            uPortUartEvent_t event;
            event.uartHandle = pUartData->uartHandle;
            event.eventBitMap = U_PORT_UART_EVENT_BITMASK_DATA_RECEIVED;
            uPortEventQueueSendIrq(pUartData->eventQueueHandle,
                                   &event, sizeof(event));
        }
        pUartData->userNeedsNotify = false;
    }
}

/* ----------------------------------------------------------------
 * PUBLIC FUNCTIONS: INTERRUPT HANDLERS
 * -------------------------------------------------------------- */

// DMA interrupt handler
void dmaIrqHandler(uint32_t dmaEngine, uint32_t dmaStream)
{
    DMA_TypeDef *const pDmaReg = gpDmaReg[dmaEngine];
    uPortUartData_t *pUartData = NULL;

    // Check half-transfer complete interrupt
    if (LL_DMA_IsEnabledIT_HT(pDmaReg, dmaStream) &&
        gpLlDmaIsActiveFlagHt[dmaStream](pDmaReg)) {
        // Clear the flag
        gpLlDmaClearFlagHt[dmaStream](pDmaReg);
        pUartData = gpDmaUart[dmaEngine][dmaStream];
    }

    // Check transfer complete interrupt
    if (LL_DMA_IsEnabledIT_TC(pDmaReg, dmaStream) &&
        gpLlDmaIsActiveFlagTc[dmaStream](pDmaReg)) {
        // Clear the flag
        gpLlDmaClearFlagTc[dmaStream](pDmaReg);
        pUartData = gpDmaUart[dmaEngine][dmaStream];
    }

    if (pUartData != NULL) {
        char *pRxBufferWriteDma;

        // Stuff has arrived: how much?
        // Get the new DMA pointer
        // LL_DMA_GetDataLength() returns a value in the sense
        // of "number of bytes left to be transmitted", so for
        // an Rx DMA we have to subtract the number from
        // the Rx buffer size
        pRxBufferWriteDma = pUartData->pRxBufferStart +
                            pUartData->rxBufferSizeBytes -
                            LL_DMA_GetDataLength(pDmaReg, dmaStream);
        // Deal with the data
        dataIrqHandler(pUartData, pRxBufferWriteDma);
    }
}

// UART interrupt handler
void uartIrqHandler(uPortUartData_t *pUartData)
{
    const uPortUartConstData_t *pUartCfg = pUartData->pConstData;
    USART_TypeDef *const pUartReg = pUartCfg->pReg;

    // Check for IDLE line interrupt
    if (LL_USART_IsEnabledIT_IDLE(pUartReg) &&
        LL_USART_IsActiveFlag_IDLE(pUartReg)) {
        char *pRxBufferWriteDma;

        // Clear flag
        LL_USART_ClearFlag_IDLE(pUartReg);

        // Get the new DMA pointer
        // LL_DMA_GetDataLength() returns a value in the sense
        // of "number of bytes left to be transmitted", so for
        // an Rx DMA we have to subtract the number from
        // the Rx buffer size
        pRxBufferWriteDma = pUartData->pRxBufferStart +
                            pUartData->rxBufferSizeBytes -
                            LL_DMA_GetDataLength(gpDmaReg[pUartCfg->dmaEngine],
                                                 pUartCfg->dmaStream);
        // Deal with the data
        dataIrqHandler(pUartData, pRxBufferWriteDma);
    }
}

#if U_CFG_HW_UART1_AVAILABLE
// USART 1 interrupt handler.
void USART1_IRQHandler()
{
    if (gpUart[1] != NULL) {
        uartIrqHandler(gpUart[1]);
    }
}
#endif

#if U_CFG_HW_UART2_AVAILABLE
// USART 2 interrupt handler.
void USART2_IRQHandler()
{
    if (gpUart[2] != NULL) {
        uartIrqHandler(gpUart[2]);
    }
}
#endif

#if U_CFG_HW_UART3_AVAILABLE
// USART 3 interrupt handler.
void USART3_IRQHandler()
{
    if (gpUart[3] != NULL) {
        uartIrqHandler(gpUart[3]);
    }
}
#endif

