u-blox/ubxlib/port/platform/stm32cube/src/u_port_uart.c
                    // Configure the GPIOs
                    // Note, using the LL driver rather than our
                    // driver or the HAL driver here partly because
                    // the example code does that and also
                    // because we need to enable the alternate
                    // function for these pins.

                    // Enable clock to the registers for the Tx/Rx pins
                    uPortPrivateGpioEnableClock(pinTx);
                    uPortPrivateGpioEnableClock(pinRx);
                    // The Pin field is a bitmap so we can do Tx and Rx
                    // at the same time as they are always on the same port
                    gpioInitStruct.Pin = (1U << U_PORT_STM32F4_GPIO_PIN(pinTx)) |
                                         (1U << U_PORT_STM32F4_GPIO_PIN(pinRx));
                    gpioInitStruct.Mode = LL_GPIO_MODE_ALTERNATE;
                    gpioInitStruct.Speed = LL_GPIO_SPEED_FREQ_VERY_HIGH;
                    // Output type doesn't matter, it is overridden by
                    // the alternate function
                    gpioInitStruct.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
                    gpioInitStruct.Pull = LL_GPIO_PULL_UP;
                    gpioInitStruct.Alternate = gGpioAf[uart];
                    platformError = LL_GPIO_Init(pUPortPrivateGpioGetReg(pinTx),
                                                 &gpioInitStruct);

                    //  Configure RTS if present
                    if ((pinRts >= 0) && (platformError == SUCCESS)) {
                        uPortPrivateGpioEnableClock(pinRts);
                        gpioInitStruct.Pin = 1U << U_PORT_STM32F4_GPIO_PIN(pinRts);
                        platformError = LL_GPIO_Init(pUPortPrivateGpioGetReg(pinRts),
                                                     &gpioInitStruct);
                    }

                    //  Configure CTS if present
                    if ((pinCts >= 0) && (platformError == SUCCESS)) {
                        uPortPrivateGpioEnableClock(pinCts);
                        gpioInitStruct.Pin = 1U << U_PORT_STM32F4_GPIO_PIN(pinCts);
                        // TODO: the u-blox C030-R412M board requires a pull-down here
                        gpioInitStruct.Pull = LL_GPIO_PULL_DOWN;
                        platformError = LL_GPIO_Init(pUPortPrivateGpioGetReg(pinCts),
                                                     &gpioInitStruct);
                    }

                    // Configure DMA
                    if (platformError == SUCCESS) {
                        // Set the channel on our DMA/Stream
                        LL_DMA_SetChannelSelection(pDmaReg, dmaStream,
                                                   gLlDmaChannel[dmaChannel]);
                        // Towards RAM
                        LL_DMA_SetDataTransferDirection(pDmaReg, dmaStream,
                                                        LL_DMA_DIRECTION_PERIPH_TO_MEMORY);
                        // Low priority
                        LL_DMA_SetStreamPriorityLevel(pDmaReg, dmaStream,
                                                      LL_DMA_PRIORITY_LOW);
                        // Circular
                        LL_DMA_SetMode(pDmaReg, dmaStream, LL_DMA_MODE_CIRCULAR);
                        // Byte-wise transfers from a fixed
                        // register in a peripheral to an
                        // incrementing location in memory
                        LL_DMA_SetPeriphIncMode(pDmaReg, dmaStream,
                                                LL_DMA_PERIPH_NOINCREMENT);
                        LL_DMA_SetMemoryIncMode(pDmaReg, dmaStream,
                                                LL_DMA_MEMORY_INCREMENT);
                        LL_DMA_SetPeriphSize(pDmaReg, dmaStream,
                                             LL_DMA_PDATAALIGN_BYTE);
                        LL_DMA_SetMemorySize(pDmaReg, dmaStream,
                                             LL_DMA_MDATAALIGN_BYTE);
                        // Not FIFO mode, whatever that is
                        LL_DMA_DisableFifoMode(pDmaReg, dmaStream);

                        // Attach the DMA to the UART at one end
                        LL_DMA_SetPeriphAddress(pDmaReg, dmaStream,
                                                (uint32_t) & (pUartReg->DR));

                        // ...and to the RAM buffer at the other end
                        LL_DMA_SetMemoryAddress(pDmaReg, dmaStream,
                                                (uint32_t) (uartData.pRxBufferStart));
                        LL_DMA_SetDataLength(pDmaReg, dmaStream,
                                             uartData.rxBufferSizeBytes);

                        // Clear all the DMA flags and the DMA pending IRQ from any previous
                        // session first, or an unexpected interrupt may result
                        gpLlDmaClearFlagHt[dmaStream](pDmaReg);
                        gpLlDmaClearFlagTc[dmaStream](pDmaReg);
                        gpLlDmaClearFlagTe[dmaStream](pDmaReg);
                        gpLlDmaClearFlagDme[dmaStream](pDmaReg);
                        gpLlDmaClearFlagFe[dmaStream](pDmaReg);
                        NVIC_ClearPendingIRQ(dmaIrq);

                        // Enable half full and transmit complete DMA interrupts
                        LL_DMA_EnableIT_HT(pDmaReg, dmaStream);
                        LL_DMA_EnableIT_TC(pDmaReg, dmaStream);

                        // Set DMA priority
                        NVIC_SetPriority(dmaIrq,
                                         NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 5, 0));

                        // Go!
                        NVIC_EnableIRQ(dmaIrq);

                        // Initialise the UART/USART
                        usartInitStruct.BaudRate = baudRate;
                        usartInitStruct.DataWidth = LL_USART_DATAWIDTH_8B;
                        usartInitStruct.StopBits = LL_USART_STOPBITS_1;
                        usartInitStruct.Parity = LL_USART_PARITY_NONE;
                        // Both transmit and received enabled
                        usartInitStruct.TransferDirection = LL_USART_DIRECTION_TX_RX;
                        usartInitStruct.HardwareFlowControl = LL_USART_HWCONTROL_NONE;
                        if ((pinRts >= 0) || (pinCts >= 0)) {
                            if ((pinRts >= 0) && (pinCts >= 0)) {
                                usartInitStruct.HardwareFlowControl = LL_USART_HWCONTROL_RTS_CTS;
                            } else {
                                if (pinRts >= 0) {
                                    usartInitStruct.HardwareFlowControl = LL_USART_HWCONTROL_RTS;
                                } else {
                                    usartInitStruct.HardwareFlowControl = LL_USART_HWCONTROL_CTS;
                                }
                            }
                        }
                        usartInitStruct.OverSampling = LL_USART_OVERSAMPLING_16;
                        platformError = LL_USART_Init(pUartReg, &usartInitStruct);
                    }

                    // Connect it all together
                    if (platformError == SUCCESS) {
                        // Asynchronous UART/USART with DMA on the receive
                        // and include only the idle line interrupt,
                        // DMA does the rest
                        LL_USART_ConfigAsyncMode(pUartReg);
                        LL_USART_EnableDMAReq_RX(pUartReg);
                        LL_USART_EnableIT_IDLE(pUartReg);

